app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def show
    @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def new
    @company    = Company.new
    @industries = Industry.all
    @jobs       = JobTitle.all
---
SELECT `industries`.* FROM `industries`
SELECT `job_titles`.* FROM `job_titles`

  def edit
    @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1

  def create
    data = params[:company][:job_titles]
    params[:company].delete :job_titles
    @company = Company.new(params[:company])

    data.each do |sid|
      if sid.empty? == false
        @company.job_titles << JobTitle.find(sid.to_i)
---
INSERT INTO `companies_job_titles` (`company_id`, `job_title_id`) VALUES (4, 1)
INSERT INTO `companies` (`contact_number`, `contact_person`, `created_at`, `email`, `industry_id`, `name`, `updated_at`, `website`) VALUES ('82651541', 'reain', '2013-05-15 19:22:59', 'eftakhairul@gmail.com', 1, 'ddd', '2013-05-15 19:22:59', 'eftakhairul.com')
SELECT `job_titles`.* FROM `job_titles` WHERE `job_titles`.`id` = 1 LIMIT 1