app/controllers/home_controller.rb

SELECT `universities`.* FROM `universities`
SELECT `majors`.* FROM `majors`
SELECT `industries`.* FROM `industries`
SELECT `job_titles`.* FROM `job_titles`
---
  def index
    @intern     = Intern.new
    @university = University.all
    @major      = Major.all
    @company    = Company.new
    @industries = Industry.all
    @jobs       = JobTitle.all