app/controllers/interns_controller.rb

SELECT `interns`.* FROM `interns`
---
  def index
    @interns = Intern.all

SELECT `interns`.* FROM `interns` WHERE `interns`.`id` = 1 LIMIT 1
---
  def show
    @intern = Intern.find(params[:id])

SELECT `universities`.* FROM `universities`
SELECT `majors`.* FROM `majors`
SELECT `job_titles`.* FROM `job_titles`
---
  def new
    @intern     = Intern.new
    @university = University.all
    @major      = Major.all
    @jobs       = JobTitle.all

INSERT INTO `interns_job_titles` (`intern_id`, `job_title_id`) VALUES (3, 1)
INSERT INTO `interns` (`contact_number`, `created_at`, `email`, `graduation_year`, `is_active`, `linkedin_address`, `major_id`, `name`, `university_id`, `updated_at`) VALUES ('12341', '2013-05-15 18:51:15', 'eftakhairul@gmail.com', 2013, 1, 'sss', NULL, '', NULL, '2013-05-15 18:51:15')
SELECT `job_titles`.* FROM `job_titles` WHERE `job_titles`.`id` = 0 LIMIT 1
---
  def create

    data = params[:intern][:job_titles]
    params[:intern].delete :job_titles
    @intern = Intern.new(params[:intern])

    @year = (2010..2020).to_a

    data.each do |sid|
      if sid.empty? == false
        @intern.job_titles << JobTitle.find(sid.to_i)