app/controllers/mentors_controller.rb

INSERT INTO `mentors` (`created_at`, `name`, `updated_at`) VALUES ('2013-05-19 18:54:52', NULL, '2013-05-19 18:54:52')
---
  def create
    @mentor = Mentor.new(params[:mentor])

    respond_to do |format|
      if @mentor.save